IMMZEK/msp-project/vasa/makedir/__programmer/deskdb/content/TICloudAgent/linux/ccs_base/common/targetdb/Modules/C2000/f28p65x_icl_xbar_regs.xml
<module id="ICL_XBAR_REGS" HW_revision="" description="ICL XBAR Registers">
	<register id="ICL1SELECT" width="16" page="1" offset="0x0" internal="0" description="ICL1SELECT Input Select Register">
		<bitfield id="SELECT" description="Select INPUT for ICL1 signal" begin="15" end="0" width="16" rwaccess="RW"/>
	</register>
	<register id="ICL2SELECT" width="16" page="1" offset="0x1" internal="0" description="ICL2SELECT Input Select Register">
		<bitfield id="SELECT" description="Select INPUT for ICL2 signal" begin="15" end="0" width="16" rwaccess="RW"/>
	</register>
	<register id="ICL3SELECT" width="16" page="1" offset="0x2" internal="0" description="ICL3SELECT Input Select Register">
		<bitfield id="SELECT" description="Select INPUT for ICL3 signal" begin="15" end="0" width="16" rwaccess="RW"/>
	</register>
	<register id="ICL4SELECT" width="16" page="1" offset="0x3" internal="0" description="ICL4SELECT Input Select Register">
		<bitfield id="SELECT" description="Select INPUT for ICL4 signal" begin="15" end="0" width="16" rwaccess="RW"/>
	</register>
	<register id="ICL5SELECT" width="16" page="1" offset="0x4" internal="0" description="ICL5SELECT Input Select Register">
		<bitfield id="SELECT" description="Select INPUT for ICL5 signal" begin="15" end="0" width="16" rwaccess="RW"/>
	</register>
	<register id="ICL6SELECT" width="16" page="1" offset="0x5" internal="0" description="ICL6SELECT Input Select Register">
		<bitfield id="SELECT" description="Select INPUT for ICL6 signal" begin="15" end="0" width="16" rwaccess="RW"/>
	</register>
	<register id="ICL7SELECT" width="16" page="1" offset="0x6" internal="0" description="ICL7SELECT Input Select Register">
		<bitfield id="SELECT" description="Select INPUT for ICL7 signal" begin="15" end="0" width="16" rwaccess="RW"/>
	</register>
	<register id="ICL8SELECT" width="16" page="1" offset="0x7" internal="0" description="ICL8SELECT Input Select Register">
		<bitfield id="SELECT" description="Select INPUT for ICL8 signal" begin="15" end="0" width="16" rwaccess="RW"/>
	</register>
	<register id="ICL9SELECT" width="16" page="1" offset="0x8" internal="0" description="ICL9SELECT Input Select Register">
		<bitfield id="SELECT" description="Select INPUT for ICL9 signal" begin="15" end="0" width="16" rwaccess="RW"/>
	</register>
	<register id="ICL10SELECT" width="16" page="1" offset="0x9" internal="0" description="ICL10SELECT Input Select Register">
		<bitfield id="SELECT" description="Select INPUT for ICL10 signal" begin="15" end="0" width="16" rwaccess="RW"/>
	</register>
	<register id="ICL11SELECT" width="16" page="1" offset="0xa" internal="0" description="ICL11SELECT Input Select Register">
		<bitfield id="SELECT" description="Select INPUT for ICL11 signal" begin="15" end="0" width="16" rwaccess="RW"/>
	</register>
	<register id="ICL12SELECT" width="16" page="1" offset="0xb" internal="0" description="ICL12SELECT Input Select Register">
		<bitfield id="SELECT" description="Select INPUT for ICL12 signal" begin="15" end="0" width="16" rwaccess="RW"/>
	</register>
	<register id="ICL13SELECT" width="16" page="1" offset="0xc" internal="0" description="ICL13SELECT Input Select Register">
		<bitfield id="SELECT" description="Select INPUT for ICL13 signal" begin="15" end="0" width="16" rwaccess="RW"/>
	</register>
	<register id="ICL14SELECT" width="16" page="1" offset="0xd" internal="0" description="ICL14SELECT Input Select Register">
		<bitfield id="SELECT" description="Select INPUT for ICL14 signal" begin="15" end="0" width="16" rwaccess="RW"/>
	</register>
	<register id="ICL15SELECT" width="16" page="1" offset="0xe" internal="0" description="ICL15SELECT Input Select Register">
		<bitfield id="SELECT" description="Select INPUT for ICL15 signal" begin="15" end="0" width="16" rwaccess="RW"/>
	</register>
	<register id="ICL16SELECT" width="16" page="1" offset="0xf" internal="0" description="ICL16SELECT Input Select Register">
		<bitfield id="SELECT" description="Select INPUT for ICL16 signal" begin="15" end="0" width="16" rwaccess="RW"/>
	</register>
	<register id="INPUTSELECTLOCK" width="32" page="1" offset="0x1e" internal="0" description="Input Select Lock Register">
		<bitfield id="ICL1SELECT" description="Lock bit for ICL1SELECT Register" begin="0" end="0" width="1" rwaccess="RW"/>
		<bitfield id="ICL2SELECT" description="Lock bit for ICL2SELECT Register" begin="1" end="1" width="1" rwaccess="RW"/>
		<bitfield id="ICL3SELECT" description="Lock bit for ICL3SELECT Register" begin="2" end="2" width="1" rwaccess="RW"/>
		<bitfield id="ICL4SELECT" description="Lock bit for ICL4SELECT Register" begin="3" end="3" width="1" rwaccess="RW"/>
		<bitfield id="ICL5SELECT" description="Lock bit for ICL5SELECT Register" begin="4" end="4" width="1" rwaccess="RW"/>
		<bitfield id="ICL6SELECT" description="Lock bit for ICL6SELECT Register" begin="5" end="5" width="1" rwaccess="RW"/>
		<bitfield id="ICL7SELECT" description="Lock bit for ICL7SELECT Register" begin="6" end="6" width="1" rwaccess="RW"/>
		<bitfield id="ICL8SELECT" description="Lock bit for ICL8SELECT Register" begin="7" end="7" width="1" rwaccess="RW"/>
		<bitfield id="ICL9SELECT" description="Lock bit for ICL9SELECT Register" begin="8" end="8" width="1" rwaccess="RW"/>
		<bitfield id="ICL10SELECT" description="Lock bit for ICL10SELECT Register" begin="9" end="9" width="1" rwaccess="RW"/>
		<bitfield id="ICL11SELECT" description="Lock bit for ICL11SELECT Register" begin="10" end="10" width="1" rwaccess="RW"/>
		<bitfield id="ICL12SELECT" description="Lock bit for ICL12SELECT Register" begin="11" end="11" width="1" rwaccess="RW"/>
		<bitfield id="ICL13SELECT" description="Lock bit for ICL13SELECT Register" begin="12" end="12" width="1" rwaccess="RW"/>
		<bitfield id="ICL14SELECT" description="Lock bit for ICL14SELECT Register" begin="13" end="13" width="1" rwaccess="RW"/>
		<bitfield id="ICL15SELECT" description="Lock bit for ICL15SELECT Register" begin="14" end="14" width="1" rwaccess="RW"/>
		<bitfield id="ICL16SELECT" description="Lock bit for ICL16SELECT Register" begin="15" end="15" width="1" rwaccess="RW"/>
	</register>
</module>
